PeriodicHill/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
4.05507e-10
3.95151e-10
3.69292e-10
3.34469e-10
2.95653e-10
2.60502e-10
2.34937e-10
2.23596e-10
...
)
;

boundaryField
{
    bottomWall
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           uniform 1e-15;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           uniform 1e-15;
    }
}


// ************************************************************************* //
