PeriodicHill/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
100
99.9971
99.9884
99.9869
99.9954
100.003
100.008
100.014
...
)
;

boundaryField
{
    bottomWall
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
99
(
399.993
400.076
400.291
400.587
401.316
402.069
402.181
401.889
...
)
;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
99
(
100
99.9971
99.9884
99.9869
99.9954
100.003
100.008
100.014
...
)
;
    }
}


// ************************************************************************* //
