PeriodicHill/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "20000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
29254
(
-5.71621e-07
6.28421e-09
-5.79614e-07
7.99253e-09
-5.83998e-07
4.38413e-09
-5.86872e-07
2.87432e-09
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            symmetry;
        value           uniform 0;
    }
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
149
(
-5.65332e-07
-1.75979e-06
-3.06813e-06
-4.48039e-06
-5.95392e-06
-7.40886e-06
-8.79081e-06
-1.00936e-05
...
)
;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
149
(
5.65332e-07
1.75979e-06
3.06813e-06
4.48039e-06
5.95392e-06
7.40886e-06
8.79081e-06
1.00936e-05
...
)
;
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
